;记事本右下角显示了该文件的编码，编码必须是 UTF-16 LE 格式，
;如果不是，请使用另存为修改编码格式。

;分离闪避与奔跑按键
[Dodging]

;游戏中的闪避按键
key_in_game=LShift

;分离后的闪避按键
key_detached=LAlt

;按键切换法术
[Spells]

;游戏中已记忆的法术
;只能使用英文分号';'分隔
equipped_spells=雷电枪;燃火;龙咬;龙爪;龙冰;划空癫火

;分离后的切换法术按键
;只能使用小写字母、只能使用英文分号';'分隔
;假设设置为 a,b,c，则表示按下 a 切换第一个法术、按下 b 切换第二个法术…
key_detached=1;2;3;4;5;6;7;8;9;0

;游戏中的切换法术按键
;只能使用小写字母
switch_spell_button=r

;游戏中法术名称在屏幕内的像素坐标范围 (左、上、右、下)
spell_name_region=

;按键切换消耗品
[Items]

;游戏中已装备的消耗品
;只能使用英文分号';'分隔
equipped_items=煮熟螃蟹;抗圣肝脏干;斑斓白肉干;振奋香;生肉丸;仿生泪滴的骨灰;玛尔基特的囚具

;分离后的切换消耗品按键
;只能使用小写字母、只能使用英文分号';'分隔
;假设设置为 a,b,c，则表示按下 a 切换第一个消耗品、按下 b 切换第二个消耗品…
key_detached=Numpad1;Numpad2;Numpad3;Numpad4;Numpad5;Numpad6;Numpad7;Numpad8;Numpad9;NumpadAdd

;游戏中的切换消耗品按键
;只能使用小写字母
switch_item_button=t

;游戏中消耗品名称在屏幕内的像素坐标范围 (左、上、右、下)
item_name_region=

[Equipment]
equipment_region=
config1=;;
config2=;;
config3=;;
config4=;;
config5=;;
config6=;;
config7=;;
config8=;;
config9=;;

[KeyMap]
config1=;
config2=;
config3=;
config4=;
config5=;
config6=;
config7=;
config8=;
config9=;
config10=;

[Common]
;切换法术和物品时，两次切换的时间间隔
;数值越低，切换速度越快，但可能因为游戏掉帧而导致切换不准确
;至少设置为 30 以上
click_interval=40

menu_button=Esc

confirm_button=e

[Resolution]
Spell_1920_1080=140;770;300;800
Item_1920_1080=140;1025;300;1055
Eqp_1920_1080=130;200;700;940

Spell_2560_1440=190;1020;400;1060
Item_2560_1440=190;1360;400;1400
Eqp_2560_1440=180;280;930;1240

Spell_3840_2160=290;1530;650;1590
Item_3840_2160=290;2050;650;2110
;Eqp_3840_2160=

